<?php
/**
 * @author: MUlt1mate
 * Date: 24.03.13
 * Time: 2:59
 */

class Text
{
    static private function translitIt($str)
    {
        $tr = array(
            "А" => "a", "Б" => "b", "В" => "v", "Г" => "g",
            "Д" => "d", "Е" => "e", "Ж" => "j", "З" => "z", "И" => "i",
            "Й" => "y", "К" => "k", "Л" => "l", "М" => "m", "Н" => "n",
            "О" => "o", "П" => "p", "Р" => "r", "С" => "s", "Т" => "t",
            "У" => "u", "Ф" => "f", "Х" => "h", "Ц" => "ts", "Ч" => "ch",
            "Ш" => "sh", "Щ" => "sch", "Ъ" => "", "Ы" => "yi", "Ь" => "",
            "Э" => "ie", "Ю" => "yu", "Я" => "ya",

            "а" => "a", "б" => "b",
            "в" => "v", "г" => "g", "д" => "d", "е" => "e", "ж" => "j",
            "з" => "z", "и" => "i", "й" => "y", "к" => "k", "л" => "l",
            "м" => "m", "н" => "n", "о" => "o", "п" => "p", "р" => "r",
            "с" => "s", "т" => "t", "у" => "u", "ф" => "f", "х" => "h",
            "ц" => "ts", "ч" => "ch", "ш" => "sh", "щ" => "sch", "ъ" => "y",
            "ы" => "yi", "ь" => "", "э" => "ie", "ю" => "yu", "я" => "ya",
            " " => "_", "." => "", "/" => "_"
        );
        return strtr($str, $tr);
    }

    static public function  translate($str)
    {
        if (preg_match('/[^A-Za-z0-9_\-]/', $str)) {
            $urlstr = self::translitIt($str);
            return preg_replace('/[^A-Za-z0-9_\-]/', '', $urlstr);
        }
    }
}